code/openfoam/etc/templates/inflowOutflowRotating/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

fields true;

baffles
{
    nonCouple
    {
        type        faceZone;
        zoneName    rotatingZone;

        owner
        {
            name        nonCouple1;
            type        patch;

            patchFields
            {
                #include    "nonCouplePatchFields"
            }
        }

        neighbour
        {
            name        nonCouple2;
            type        patch;

            patchFields
            {
                #include    "nonCouplePatchFields"
            }
        }
    }
}

// ************************************************************************* //
